tutorials/twoPhaseStratifiedFlow/meshA/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

applicationClass channelBubbleSurfaceTrackFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 10.0;

deltaT 1e-06; //e-4

writeControl adjustableRunTime;

writeInterval 0.1;

cycleWrite 0; //3

writeFormat ascii;

writePrecision 16;

writeCompression uncompressed;

timeFormat general;

timePrecision 12;

runTimeModifiable yes;
adjustTimeStep yes;
maxCo 0.1; //0.5 //1

maxDeltaT 1e-05; //1

minDeltaT 5e-07; 	/*functions
(
    bubbleHistory
    {
        type bubbleHistory;
        functionObjectLibs
        (
            "libfunctionObjectsST.so"
        );
    }

);*/// ************************************************************************* //

