tutorials/twoPhaseStratifiedFlow/meshA/constant/fastSorptionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      surfactantTranspProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fastSorptionModel	fastLangmuir;

fastLangmuirCoeffs
{

LangmuirConst LangmuirConst [ 0 1 0 0 0 0 0 ] 4.85e-3;

saturatedSurfConc saturatedSurfConc [ 0 -2 0 0 1 0 0 ] 4.17e-6;

bulkDiffusionCoeff  bulkDiffusionCoeff  [ 0  2 -1 0  0 0 0 ] 5.0e-10;

surfaceDiffusionCoeff   surfaceDiffusionCoeff  [ 0  2 -1 0  0 0 0 ] 5.0e-7;

cleanSurfTension cleanSurfTension [ 1 0 -2 0 0 0 0 ] 66.69e-3;//0.07232;

surfactT surfactT [ 0 0 0 1 0 0 0 ] 296.0;

surfactR surfactR [ 1 2 -2 -1 -1 0 0 ] 8.314; //universal gas constant
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
