tutorials/twoPhaseStratifiedFlow/meshA/constant/interfacialMultiphysicsProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mixtureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Surfactant treatment
massTransferFluxCorrection no; //yes; // correct interfacial flux by reduction factor

KSigma          KSigma  [ 1 0 -2 0 0 0 0 ] 0.1;

//ckSigmaInfty    ckSigmaInfty    [ 0 -2  0 0  1 0 0 ] 5e-6;

// ************************************************************************* //
