tutorials/twoPhaseStratifiedFlow/meshA/system/sampleDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location system;
 object sampleDict;
}

interpolationScheme cellPoint;

setFormat raw;

sets
  (
    DataFile

    {
      type uniform;
      axis y;
      start (0 0 0);
      end (0.04 0.02 0);
      nPoints 10000;

    }
  );

surfaces
  (
  );

fields
  (
    U
  ); 	// *********************************************************************** //

